BusinessProcesses/СоздатьПользователяИнформационнойБазыАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<BusinessProcess>
		<Properties>
			<Name>СоздатьПользователяИнформационнойБазыАИТП</Name>
			<Task>Task.ЗадачаАИТП</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияСтандартная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияОС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноИзменятьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияOpenID</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредупреждатьОбОпасныхДействиях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалятьПарольПриЗавершении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

Enums/ВидыЗадачАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыЗадачАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработкаОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыВыполненияДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>РезультатыВыполненияДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Положительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отрицательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДальнейшиеДействияАИТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ДальнейшиеДействияАИТП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продолжить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BusinessProcesses/СоздатьПользователяИнформационнойБазыАИТП/Ext/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПередСтартомБП(
			ТочкаМаршрутаБизнесПроцесса,
			ЭтотОбъект
		);
		
КонецПроцедуры

Процедура СоздатьПользователяИнформационнойБазыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриСозданииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			ФормируемыеЗадачи[0],
			Перечисления.ВидыЗадачАИТП.Действие,
			"СоздатьПользователейИнформационнойБазыАИТП"
		);
			
КонецПроцедуры

Процедура СоздатьПользователяИнформационнойБазыПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриВыполненииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			Задача
		);
		
КонецПроцедуры

Процедура РезультатСозданияПользователяОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
	Результат = БизнесПроцессыАИТП.ВыборВариантаРезультатПоложительныйОтрицательныйОшибка(
			ТочкаВыбораВарианта,
			ЭтотОбъект,
			БизнесПроцессы.СоздатьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.СоздатьПользователяИнформационнойБазы
		);
		
КонецПроцедуры

Процедура ОбработатьОшибкуСозданияПользователяИБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	// Вставить содержимое обработчика.
	Задача = БизнесПроцессыАИТП.ПолучитьИнформациюОПоследнейВыполненнойЗадаче(
			ЭтотОбъект,
			БизнесПроцессы.СоздатьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.СоздатьПользователяИнформационнойБазы
		).Задача;
		
	ФормируемыеЗадачи[0].ОшибкаДляОбработки = Задача.Ошибка;
	
	БизнесПроцессыАИТП.ПриСозданииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			ФормируемыеЗадачи[0],
			Перечисления.ВидыЗадачАИТП.ОбработкаОшибки
		);
		
КонецПроцедуры

Процедура ОбработатьОшибкуСозданияПользователяИБПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
	БизнесПроцессыАИТП.ПриВыполненииЗадачи(
			ТочкаМаршрутаБизнесПроцесса,
			Задача
		);
		
КонецПроцедуры

Процедура ДальнейшиеДействияОбработатьОшибкуСозданияПользователяИБОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	// Вставить содержимое обработчика.
	Результат = БизнесПроцессыАИТП.ВыборВариантаПродолжитьПовторитьЗавершитьОтменить(
			ТочкаВыбораВарианта,
			ЭтотОбъект,
			БизнесПроцессы.СоздатьПользователяИнформационнойБазыАИТП.ТочкиМаршрута.ОбработатьОшибкуСозданияПользователяИБ
		);
		
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	Если Не ЭтотОбъект.НеУдалятьПарольПриЗавершении = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
		КонфиденциальныеДанныеАИТП.УдалитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	БизнесПроцессыАИТП.ПриЗавершенииБП(
			ТочкаМаршрутаБизнесПроцесса
			, ЭтотОбъект
			, Перечисления.РезультатыВыполненияДействияАИТП.Положительный
			, Перечисления.ДальнейшиеДействияАИТП.Продолжить
		);
		
КонецПроцедуры

Процедура УстановитьПароль(Пароль) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	КонфиденциальныеДанныеАИТП.ВставитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка,, ПолучитьДвоичныеДанныеИзСтроки(Пароль));
	
КонецПроцедуры

Процедура ЗавершениеОтменитьПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	Если Не ЭтотОбъект.НеУдалятьПарольПриЗавершении = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
		КонфиденциальныеДанныеАИТП.УдалитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	
	БизнесПроцессыАИТП.ПриЗавершенииБП(ТочкаМаршрутаБизнесПроцесса
		, ЭтотОбъект
		, Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный
		, Перечисления.ДальнейшиеДействияАИТП.Отменить
		);
		
КонецПроцедуры

Процедура ЗавершениеЗавершитьПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Вставить содержимое обработчика.
	Если Не ЭтотОбъект.НеУдалятьПарольПриЗавершении = Истина Тогда
		УстановитьПривилегированныйРежим(Истина);
		КонфиденциальныеДанныеАИТП.УдалитьКонфиденциальныеДанные(ЭтотОбъект.Ссылка);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
		
	БизнесПроцессыАИТП.ПриЗавершенииБП(ТочкаМаршрутаБизнесПроцесса
		, ЭтотОбъект
		, Перечисления.РезультатыВыполненияДействияАИТП.Отрицательный
		, Перечисления.ДальнейшиеДействияАИТП.Завершить
		);
	
КонецПроцедуры

#КонецОбласти
